Revit 2024 API
RebarRoundingManager.ApplicableSegmentLengthRounding Property
 The applicable rounding for shared parameters used by rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double ApplicableSegmentLengthRounding { get; }
Visual Basic
Public ReadOnly Property ApplicableSegmentLengthRounding As Double
	Get
Visual C++
public:
property double ApplicableSegmentLengthRounding {
	double get ();
}
Remarks
 IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true. ApplicableSegmentLengthRounding is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
See Also
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace